"""
Задача 1 — Merge Sort для заказов по сумме

Контекст:
Система выгружает заказы в случайном порядке. Требуется стабильная сортировка по сумме заказа.

Входные данные:

orders = [540, 120, 800, 300, 450, 200]

Задача:
        1.	Реализовать Merge Sort
        2.	Отсортировать список по возрастанию
        3.	Вывести результат

Требование:
Нельзя использовать встроенную sort().

Цель:
Отработать:
        •	рекурсию
        •	разбиение массива
        •	слияние списков
"""

ordes: list[int] = [540, 120, 800, 300, 450, 200]
